feaser/openblt/uart_refactoring/Target/Demo/HCS12_DevKit_S12G128_CodeWarrior/Prog/lib/mc9s12g128.h
/* Tip for register initialization in the user code:  const byte NVFSEC_INIT @0x0000FF0F = <NVFSEC_INITVAL>; */
#define _NVFSEC (*(const NVFSECSTR *)0x0000FF0F)
#define NVFSEC                          _NVFSEC.Byte
#define NVFSEC_SEC0                     _NVFSEC.Bits.SEC0
#define NVFSEC_SEC1                     _NVFSEC.Bits.SEC1
#define NVFSEC_RNV2                     _NVFSEC.Bits.RNV2
#define NVFSEC_RNV3                     _NVFSEC.Bits.RNV3
#define NVFSEC_RNV4                     _NVFSEC.Bits.RNV4
#define NVFSEC_RNV5                     _NVFSEC.Bits.RNV5
#define NVFSEC_KEYEN0                   _NVFSEC.Bits.KEYEN0
#define NVFSEC_KEYEN1                   _NVFSEC.Bits.KEYEN1
#define NVFSEC_SEC                      _NVFSEC.MergedBits.grpSEC
#define NVFSEC_RNV_2                    _NVFSEC.MergedBits.grpRNV_2
#define NVFSEC_KEYEN                    _NVFSEC.MergedBits.grpKEYEN
#define NVFSEC_RNV                      NVFSEC_RNV_2

#define NVFSEC_SEC0_MASK                1U
#define NVFSEC_SEC1_MASK                2U
#define NVFSEC_RNV2_MASK                4U
#define NVFSEC_RNV3_MASK                8U
#define NVFSEC_RNV4_MASK                16U
#define NVFSEC_RNV5_MASK                32U
#define NVFSEC_KEYEN0_MASK              64U
#define NVFSEC_KEYEN1_MASK              128U
#define NVFSEC_SEC_MASK                 3U
#define NVFSEC_SEC_BITNUM               0U
#define NVFSEC_RNV_2_MASK               60U
#define NVFSEC_RNV_2_BITNUM             2U
#define NVFSEC_KEYEN_MASK               192U
#define NVFSEC_KEYEN_BITNUM             6U


  /* Watchdog reset macro */
#ifndef __RESET_WATCHDOG
#ifdef _lint
  #define __RESET_WATCHDOG()  /* empty */
#else
  #define __RESET_WATCHDOG() (void)(CPMUARMCOP = 0x55U, CPMUARMCOP = 0xAAU)
#endif
#endif /* __RESET_WATCHDOG */


/***********************************************/
/**   D E P R E C I A T E D   S Y M B O L S   **/
/***********************************************/
/* --------------------------------------------------------------------------- */
/* The following symbols were removed, because they were invalid or irrelevant */
/* --------------------------------------------------------------------------- */

/* **** 8.6.2010 13:51:25 */

/*** CPMUAPITR - Autonomous Periodical Interrupt Trimming Register; 0x000002F3 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte APITR0      :1;                                       /* Autonomous Periodical Interrupt Period Trimming Bit 0 */
    byte APITR1      :1;                                       /* Autonomous Periodical Interrupt Period Trimming Bit 1 */
    byte APITR2      :1;                                       /* Autonomous Periodical Interrupt Period Trimming Bit 2 */
    byte APITR3      :1;                                       /* Autonomous Periodical Interrupt Period Trimming Bit 3 */
    byte APITR4      :1;                                       /* Autonomous Periodical Interrupt Period Trimming Bit 4 */
    byte APITR5      :1;                                       /* Autonomous Periodical Interrupt Period Trimming Bit 5 */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpAPITR :6;
  } MergedBits;
} CPMUAPITRSTR;
extern volatile CPMUAPITRSTR _CPMUAPITR @(REG_BASE + 0x000002F3UL);
#define CPMUAPITR                       _CPMUAPITR.Byte
#define CPMUAPITR_APITR0                _CPMUAPITR.Bits.APITR0
#define CPMUAPITR_APITR1                _CPMUAPITR.Bits.APITR1
#define CPMUAPITR_APITR2                _CPMUAPITR.Bits.APITR2
#define CPMUAPITR_APITR3                _CPMUAPITR.Bits.APITR3
#define CPMUAPITR_APITR4                _CPMUAPITR.Bits.APITR4
#define CPMUAPITR_APITR5                _CPMUAPITR.Bits.APITR5
#define CPMUAPITR_APITR                 _CPMUAPITR.MergedBits.grpAPITR

#define CPMUAPITR_APITR0_MASK           4U
#define CPMUAPITR_APITR1_MASK           8U
#define CPMUAPITR_APITR2_MASK           16U
#define CPMUAPITR_APITR3_MASK           32U
#define CPMUAPITR_APITR4_MASK           64U
#define CPMUAPITR_APITR5_MASK           128U
#define CPMUAPITR_APITR_MASK            252U
#define CPMUAPITR_APITR_BITNUM          2U

#define RDRIV                            This_symb_has_been_depreciated
#define RDRIV_RDPA                       This_symb_has_been_depreciated
#define RDRIV_RDPB                       This_symb_has_been_depreciated
#define RDRIV_RDPC                       This_symb_has_been_depreciated
#define RDRIV_RDPD                       This_symb_has_been_depreciated
#define RDRIV_RDPE                       This_symb_has_been_depreciated
#define RDRIV_RDPx                       This_symb_has_been_depreciated
#define RDRIV_RDPA_MASK                  This_symb_has_been_depreciated
#define RDRIV_RDPB_MASK                  This_symb_has_been_depreciated
#define RDRIV_RDPC_MASK                  This_symb_has_been_depreciated
#define RDRIV_RDPD_MASK                  This_symb_has_been_depreciated
#define RDRIV_RDPE_MASK                  This_symb_has_been_depreciated
#define RDRIV_RDPx_MASK                  This_symb_has_been_depreciated
#define RDRIV_RDPx_BITNUM                This_symb_has_been_depreciated
#define VectorNumber_Vspi                VectorNumber_Vspi0
#define Vspi                             Vspi0
#define CPMUCLKS_COPOSCSEL               CPMUCLKS_COPOSCSEL0
#define CPMUCLKS_COPOSCSEL_MASK          CPMUCLKS_COPOSCSEL0_MASK
#define RDR0AD                           This_symb_has_been_depreciated
#define RDR0AD_RDR0AD0                   This_symb_has_been_depreciated
#define RDR0AD_RDR0AD1                   This_symb_has_been_depreciated
#define RDR0AD_RDR0AD2                   This_symb_has_been_depreciated
#define RDR0AD_RDR0AD3                   This_symb_has_been_depreciated
#define RDR0AD_RDR0AD4                   This_symb_has_been_depreciated
#define RDR0AD_RDR0AD5                   This_symb_has_been_depreciated
#define RDR0AD_RDR0AD6                   This_symb_has_been_depreciated
#define RDR0AD_RDR0AD7                   This_symb_has_been_depreciated
#define RDR0AD_RDR0AD0_MASK              This_symb_has_been_depreciated
#define RDR0AD_RDR0AD1_MASK              This_symb_has_been_depreciated
#define RDR0AD_RDR0AD2_MASK              This_symb_has_been_depreciated
#define RDR0AD_RDR0AD3_MASK              This_symb_has_been_depreciated
#define RDR0AD_RDR0AD4_MASK              This_symb_has_been_depreciated
#define RDR0AD_RDR0AD5_MASK              This_symb_has_been_depreciated
#define RDR0AD_RDR0AD6_MASK              This_symb_has_been_depreciated
#define RDR0AD_RDR0AD7_MASK              This_symb_has_been_depreciated
#define RDR1AD                           This_symb_has_been_depreciated
#define RDR1AD_RDR1AD0                   This_symb_has_been_depreciated
#define RDR1AD_RDR1AD1                   This_symb_has_been_depreciated
#define RDR1AD_RDR1AD2                   This_symb_has_been_depreciated
#define RDR1AD_RDR1AD3                   This_symb_has_been_depreciated
#define RDR1AD_RDR1AD4                   This_symb_has_been_depreciated
#define RDR1AD_RDR1AD5                   This_symb_has_been_depreciated
#define RDR1AD_RDR1AD6                   This_symb_has_been_depreciated
#define RDR1AD_RDR1AD7                   This_symb_has_been_depreciated
#define RDR1AD_RDR1AD0_MASK              This_symb_has_been_depreciated
#define RDR1AD_RDR1AD1_MASK              This_symb_has_been_depreciated
#define RDR1AD_RDR1AD2_MASK              This_symb_has_been_depreciated
#define RDR1AD_RDR1AD3_MASK              This_symb_has_been_depreciated
#define RDR1AD_RDR1AD4_MASK              This_symb_has_been_depreciated
#define RDR1AD_RDR1AD5_MASK              This_symb_has_been_depreciated
#define RDR1AD_RDR1AD6_MASK              This_symb_has_been_depreciated
#define RDR1AD_RDR1AD7_MASK              This_symb_has_been_depreciated
#define RDR01AD                          This_symb_has_been_depreciated
#define RDR01AD_RDR1AD0                  This_symb_has_been_depreciated
#define RDR01AD_RDR1AD1                  This_symb_has_been_depreciated
#define RDR01AD_RDR1AD2                  This_symb_has_been_depreciated
#define RDR01AD_RDR1AD3                  This_symb_has_been_depreciated
#define RDR01AD_RDR1AD4                  This_symb_has_been_depreciated
#define RDR01AD_RDR1AD5                  This_symb_has_been_depreciated
#define RDR01AD_RDR1AD6                  This_symb_has_been_depreciated
#define RDR01AD_RDR1AD7                  This_symb_has_been_depreciated
#define RDR01AD_RDR0AD0                  This_symb_has_been_depreciated
#define RDR01AD_RDR0AD1                  This_symb_has_been_depreciated
#define RDR01AD_RDR0AD2                  This_symb_has_been_depreciated
#define RDR01AD_RDR0AD3                  This_symb_has_been_depreciated
#define RDR01AD_RDR0AD4                  This_symb_has_been_depreciated
#define RDR01AD_RDR0AD5                  This_symb_has_been_depreciated
#define RDR01AD_RDR0AD6                  This_symb_has_been_depreciated
#define RDR01AD_RDR0AD7                  This_symb_has_been_depreciated
#define RDR01AD_RDR1AD                   This_symb_has_been_depreciated
#define RDR01AD_RDR0AD                   This_symb_has_been_depreciated
#define RDR01AD_RDR1AD0_MASK             This_symb_has_been_depreciated
#define RDR01AD_RDR1AD1_MASK             This_symb_has_been_depreciated
#define RDR01AD_RDR1AD2_MASK             This_symb_has_been_depreciated
#define RDR01AD_RDR1AD3_MASK             This_symb_has_been_depreciated
#define RDR01AD_RDR1AD4_MASK             This_symb_has_been_depreciated
#define RDR01AD_RDR1AD5_MASK             This_symb_has_been_depreciated
#define RDR01AD_RDR1AD6_MASK             This_symb_has_been_depreciated
#define RDR01AD_RDR1AD7_MASK             This_symb_has_been_depreciated
#define RDR01AD_RDR0AD0_MASK             This_symb_has_been_depreciated
#define RDR01AD_RDR0AD1_MASK             This_symb_has_been_depreciated
#define RDR01AD_RDR0AD2_MASK             This_symb_has_been_depreciated
#define RDR01AD_RDR0AD3_MASK             This_symb_has_been_depreciated
#define RDR01AD_RDR0AD4_MASK             This_symb_has_been_depreciated
#define RDR01AD_RDR0AD5_MASK             This_symb_has_been_depreciated
#define RDR01AD_RDR0AD6_MASK             This_symb_has_been_depreciated
#define RDR01AD_RDR0AD7_MASK             This_symb_has_been_depreciated
#define RDR01AD_RDR1AD_MASK              This_symb_has_been_depreciated
#define RDR01AD_RDR1AD_BITNUM            This_symb_has_been_depreciated
#define RDR01AD_RDR0AD_MASK              This_symb_has_been_depreciated
#define RDR01AD_RDR0AD_BITNUM            This_symb_has_been_depreciated

#ifndef __V30COMPATIBLE__
#pragma OPTION DEL V30toV31Compatible
#endif
/*lint -restore  +esym(961,18.4) +esym(961,19.7) Enable MISRA rule (1.1,18.4,6.4,19.7) checking. */

#endif
